{
"yin24_udp":{
	"title":"Packet Aggregation May Harm Batched Network Coding",
	"author":"<b>H. H. F. Yin</b>",
	"fullauthor":"<b>Hoover H. F. Yin</b>",
	"booktitle":"2024 IEEE Region 10 Conference (TENCON)",
	"address":"Singapore",
	"date":"1-4 Dec. 2024",
	"abstract":"Batched network coding (BNC) is a solution to multi-hop transmission on networks with packet loss. To be compatible with the existing infrastructure, BNC is usually implemented over UDP. A single error bit will probably result in discarding the packet. UDP-Lite is a variant of UDP that supports partial checksums. As long as the data covered by the checksum is correct, damaged payload will be delivered. With UDP-Lite, we can cope with other techniques such as payload aggregation of BNC packets to reduce the protocol overhead, and forward error correction to combat against bit errors. Unlike traditional transmissions, BNC has a loss resilience feature and there are dependencies between BNC packets. In this paper, we conduct a preliminary investigation on BNC over UDP-Lite. We show that aggregating as much as we can is not always the best strategy, and a hop-by-hop distributed efficiency optimization approach may lead to a worse throughput compared with the scheme without aggregation in a long network. These unnatural results caution that a casual integration of techniques with BNC can be harmful, and give us hints on future research directions.",
	"field":"nc"
},
"yin24_rf":{
	"title":"Time Efficiency of BATS Coding on Wireless Relay Network With Overhearing",
	"author":"<b>H. H. F. Yin</b>",
	"fullauthor":"<b>Hoover H. F. Yin</b>",
	"booktitle":"2024 IEEE Region 10 Conference (TENCON)",
	"address":"Singapore",
	"date":"1-4 Dec. 2024",
	"abstract":"Wireless relay network is a solution to extend the reach of a wireless connection by installing a relay node between the source node and the sink node. Due to the broadcast nature of wireless transmission, the sink node has a chance to receive part of the data sent by the source node. In this paper, we apply a network coding scheme called BATS codes on a wireless relay network where the relay node has a stable power supply, so that we can aim for the best decoding time instead of minimizing the number of transmissions for saving energy. We optimize the time efficiency that maximize the average decoding rate per unit time by some heuristics, and bring out a message that it is not optimal to set an average number of recoded packets per batch at the relay node equals the number of packets per batch sent by the source node.",
	"field":"nc"
},
"yin24_sparse":{
	"title":"Sparse Degree Optimization for BATS Codes",
	"author":"<b>H. H. F. Yin</b> and J. Wang",
	"fullauthor":"<b>Hoover H. F. Yin</b>, Jie Wang",
	"booktitle":"2024 IEEE Information Theory Workshop (ITW)",
	"address":"Shenzhen, China",
	"date":"24-28 Nov. 2024",
	"url":"https://ieeexplore.ieee.org/document/10807013",
	"doi":"10.1109/ITW61385.2024.10807013",
	"pages":"753-758",
	"abstract":"Batched sparse (BATS) code is a class of batched network code that can achieve a close-to-optimal rate when an optimal degree distribution is provided. We observed that most probability masses in this optimal distribution are very small, i.e., the distribution “looks” sparse. In this paper, we investigate the sparsity optimization of degree distribution for BATS codes that produces sparse degree distributions. There are many advantages to use a sparse degree distribution, say, it is robust to precision errors when sampling the degree distribution during encoding and decoding in practice. We discuss a few heuristics and also a way to obtain an exact sparsity solution. These approaches give a trade-off between computational time and achievable rate, thus give us the flexibility to adopt BATS codes in various scenarios, e.g., device with limited computational power, stable channel condition, etc.",
	"field":"nc"
},
"yin24_dro":{
	"title":"Distributionally Robust Degree Optimization for BATS Codes",
	"author":"<b>H. H. F. Yin</b>, J. Wang, and S. S. M. Chow",
	"fullauthor":"<b>Hoover H. F. Yin</b>, Jie Wang, Sherman S. M. Chow",
	"booktitle":"2024 IEEE International Symposium on Information Theory (ISIT)",
	"address":"Athens, Greece",
	"date":"7-12 Jul. 2024",
	"url":"https://ieeexplore.ieee.org/document/10619460",
	"doi":"10.1109/ISIT57864.2024.10619460",
	"pages":"1315-1320",
	"abstract":"Batched sparse (BATS) code is a network coding solution for multi-hop wireless networks with packet loss. Achieving a close-to-optimal rate relies on an optimal degree distribution. Technical challenges arise from the sensitivity of this distribution to the often empirically obtained rank distribution at the destination node. Specifically, if the empirical distribution overestimates the channel, BATS codes experience a significant rate degradation, leading to unstable rates across different runs and hence unpredictable transmission costs. Confronting this unresolved obstacle, we introduce a formulation for distributionally robust optimization in degree optimization. Deploying the resulting degree distribution resolves the instability of empirical rank distributions, ensuring a close-to-optimal rate, and unleashing the potential of applying BATS codes in real-world scenarios.",
	"field":"nc"
},
"woo24_dataset":{
	"title":"Dataset, Noise Analysis, and Automated Parameter Estimation for Natural Steganography",
	"author":"I. K. Y. Woo, S. Yiu, <b>H. H. F. Yin</b>, and R. W. F. Lai",
	"fullauthor":"Ivy K. Y. Woo, Sheung Yiu, <b>Hoover H. F. Yin</b>, Russell W. F. Lai",
	"booktitle":"12th ACM Workshop on Information Hiding and Multimedia Security (IH&MMSec)",
	"address":"Baiona, Spain",
	"date":"24-26 Jun. 2024",
	"url":"https://dl.acm.org/doi/10.1145/3658664.3659660",
	"doi":"10.1145/3658664.3659660",
	"pages":"13-18",
	"abstract":"Natural steganography concerns embedding a secret message in a cover-source following some distribution \\(\\mathcal{S}_1\\), such that after embedding the distribution of the stego-media mimics another cover-source with distribution \\(\\mathcal{S}_2\\) (without embedding). Prior works have studied natural steganography over image files, where \\(\\mathcal{S}_1\\) and \\(\\mathcal{S}_2\\) correspond to the light intensity distribution of a photo taken respectively at some \\(\\text{ISO}_1\\) and \\(\\text{ISO}_2\\), and much effort has been dedicated to various embedding methods. On the other hand, while the nature of mimicking the distribution \\(\\mathcal{S}_2\\) by embedding messages into \\(\\mathcal{S}_1\\) sources means that accurate estimations of such distributions are crucial, relatively little attention has been given to this aspect. Furthermore, deploying these stegosystems in practice requires users to estimate the noise distributions of their cameras, which poses a challenging technological barrier for average users and limits the utility of the stegosystems.<p>An objective of this work is to verify the existing claim that, for each fixed ISO value, the pixel values follow a family of Gaussian distributions where the variance is an affine function of the mean. Towards estimating and verifying the concerned distributions, we have created a comprehensive image dataset with the mainstream Sony A6400 camera in a professional photo-shooting environment. Analyses over our dataset reveal that parameters of the light intensity distributions appear to have more complicated behaviour than reported in prior works - they seem to depend on the overall exposure level induced by the camera settings. For the ease of analysis, we have also developed a set of tools for automating the parameter estimation process. We believe that these tools will eventually improve the accessibility of natural steganography.",
	"field":"misc"
},
"yin23_mole":{
	"title":"Multichannel One-Time Length Encoding: Exploiting Channel Redundancy",
	"author":"<b>H. H. F. Yin</b>, X. Wang, Q. Cao, and S. Liu",
	"fullauthor":"<b>Hoover H. F. Yin</b>, Xishi Wang, Qi Cao, Shiqiu Liu",
	"booktitle":"2023 IEEE Virtual Conference on Communications (VCC)",
	"address":"Virtual",
	"date":"28-30 Nov. 2023",
	"url":"https://ieeexplore.ieee.org/document/10474808/",
	"doi":"10.1109/VCC60689.2023.10474808",
	"pages":"218-223",
	"abstract":"In some applications, communication would be terminated shortly due to reasons like security, secrecy, or energy saving. The time interval between two messages can be very long so that the idling interval is longer than sufficient to distinguish the messages. On the other hand, when there are multiple channels available, the channel-use allocation on the channels carries some information. In this paper, we exploit the use of the information carried by the channel-use allocation, specifically, the number of bits sent via each channel, so that we can transmit some extra bits implicitly at no extra cost. We propose a concrete scheme to make use of this advantage.",
	"field":"it"
},
"wong23_eddsa":{
	"title":"How (Not) to Build Threshold EdDSA",
	"author":"H. W. H. Wong, J. P. K. Ma, <b>H. H. F. Yin</b>, and S. S. M. Chow",
	"fullauthor":"Harry W. H. Wong, Jack P. K. Ma, <b>Hoover H. F. Yin</b>, Sherman S. M. Chow",
	"booktitle":"26th International Symposium on Research in Attacks, Intrusions, and Defenses (RAID 2023)",
	"address":"Hong Kong",
	"date":"16-18 Oct. 2023",
	"url":"https://dl.acm.org/doi/10.1145/3607199.3607230",
	"doi":"10.1145/3607199.3607230",
	"pages":"123-134",
	"abstract":"Edwards-curve digital signature algorithm (EdDSA) is a highly efficient scheme with a short key size. It is derived from the threshold-friendly Schnorr signatures and is covered by the NIST standardization efforts of threshold cryptographic primitives. Nevertheless, extending its deterministic nonce generation to the threshold setting requires heavyweight cryptographic techniques, even when the hash function is replaced with one optimized for secure multi-party computation. Indeed, an efficient extension to the threshold setting is considered a major challenge by NIST and academia.<p>In RAID 2022, a threshold EdDSA scheme is proposed with the nonce generation using only modular addition instead of a hash. This paper unveils the security flaw of this efficient design. We also propose a generic hybrid approach with a showcase of extending a state-of-the-art threshold Schnorr signature scheme. It enjoys a similar level of immunity to side-channel or fault injection attacks as the more heavyweight threshold extension of deterministic nonce generation, but is much more efficient due to its simplicity.",
	"field":"misc"
},
"yin23_mcd":{
	"title":"Multichannel Dual Codes: The Choice of Channels Carries Information",
	"author":"<b>H. H. F. Yin</b> and X. Wang",
	"fullauthor":"<b>Hoover H. F. Yin</b>, Xishi Wang",
	"booktitle":"2023 IEEE Information Theory Workshop (ITW)",
	"address":"Saint-Malo, France",
	"date":"23-28 Apr. 2023",
	"url":"https://ieeexplore.ieee.org/document/10161634",
	"doi":"10.1109/ITW55543.2023.10161634",
	"pages":"317-322",
	"abstract":"When there are multiple channels between a pair of source and destination, the way to use the channels carries some extra information. In this paper, we study a coding scheme that encodes the message into the choices of channels. Unlike the traditional sense that the message bits are ordered in a temporal manner, the ordering information is lost after the transformation. To resolve this issue, the data to be sent via the channels is the ordering of the message blocks. We study the properties on the number of channel-uses and the limitation of the code. We also investigate the optimal message length that maximize the efficiency of channel-uses.",
	"field":"it"
},
"wong23_ecdsa":{
	"title":"Real Threshold ECDSA",
	"author":"H. W. H. Wong, J. P. K. Ma, <b>H. H. F. Yin</b>, and S. S. M. Chow",
	"fullauthor":"Harry W. H. Wong, Jack P. K. Ma, <b>Hoover H. F. Yin</b>, Sherman S. M. Chow",
	"booktitle":"Network and Distributed System Security (NDSS) Symposium 2023",
	"address":"San Diego, CA, USA",
	"date":"27 Feb.-3 Mar. 2023",
	"url":"https://www.ndss-symposium.org/ndss-paper/real-threshold-ecdsa/",
	"doi":"10.14722/ndss.2023.24817",
	"abstract":"Threshold ECDSA recently regained popularity due to decentralized applications such as DNSSEC and cryptocurrency asset custody. Latest (communication-optimizing) schemes often assume all \\(n\\) or at least \\(n' \\ge t\\) participating users remain honest throughout the pre-signing phase, essentially degenerating to \\(n'\\)-out-of-\\(n'\\) multiparty signing instead of \\(t\\)-out-of-\\(n\\) threshold signing. When anyone misbehaves, all signers must restart from scratch, rendering prior computation and communication in vain. This hampers the adoption of threshold ECDSA in time-critical situations and confines its use to a small signing committee.<p>To mitigate such denial-of-service vulnerabilities prevalent in state-of-the-art, we propose a robust threshold ECDSA scheme that achieves the \\(t\\)-out-of-\\(n\\) threshold flexibility &quot;for real&quot; throughout the whole pre-signing and signing phases without assuming an honest majority. Our scheme is desirable when computational resources are scarce and in a decentralized setting where faults are easier to be induced. Our design features \\(4\\)-round pre-signing, \\(\\mathcal{O}(n)\\) cheating identification, and self-healing machinery over distributive shares. Prior arts mandate abort after an \\(\\mathcal{O}(n^2)\\)-cost identification, albeit with \\(3\\)-round pre-signing (Canetti et al., CCS '20), or \\(\\mathcal{O}(n)\\) using \\(6\\) rounds (Castagnos et al., TCS '23). Empirically, our scheme saves up to \\(\\sim30\\%\\) of the communication cost, depending on at which stage the fault occurred.",
	"field":"misc"
},
"yin22_parallel":{
	"title":"On the Applications and Parallelization of Multichannel Source Coding",
	"author":"<b>H. H. F. Yin</b>, I. K. Y. Woo, and R. W. F. Lai",
	"fullauthor":"<b>Hoover H. F. Yin</b>, Ivy K. Y. Woo, Russell W. F. Lai",
	"booktitle":"2022 IEEE Region 10 Conference (TENCON)",
	"address":"Hong Kong",
	"date":"1-4 Nov. 2022",
	"url":"https://ieeexplore.ieee.org/document/9977596",
	"doi":"10.1109/TENCON55691.2022.9977596",
	"abstract":"Each codeword in Multichannel Source Coding (MSC) naturally uses multiple channels simultaneously. Previous works only focused on the theoretical aspects of MSC. In this paper, we discuss the applications and parallelization of MSC.",
	"field":"it"
},
"yin22_recoder":{
	"title":"On the Design of Timeout-Based Recoders for Batched Network Codes in the MU-MIMO Regime",
	"author":"<b>H. H. F. Yin</b> and M. Tahernia",
	"fullauthor":"<b>Hoover H. F. Yin</b>, Mehrdad Tahernia",
	"booktitle":"2022 IEEE Region 10 Conference (TENCON)",
	"address":"Hong Kong",
	"date":"1-4 Nov. 2022",
	"url":"https://ieeexplore.ieee.org/document/9977828",
	"doi":"10.1109/TENCON55691.2022.9977828",
	"abstract":"Batched network coding is a branch of network coding for multi-hop communications via lossy channels. The design of the batch management unit in timeout-based recoders in the MU-MIMO regime is presented.",
	"field":"nc"
},
"yin22_wifi":{
	"title":"Back to Basics: Non-Mesh Multi-Hop Wi-Fi Backhaul on Smart Lamppost Network",
	"author":"<b>H. H. F. Yin</b>, K. H. Lee, O. M. H. Chau, R. K. Chan, and C. K. Y. Tse",
	"fullauthor":"<b>Hoover H. F. Yin</b>, Kin Hong Lee, Oscar M. H. Chau, Raymond K. Chan, Connie K. Y. Tse",
	"booktitle":"2022 IEEE Region 10 Conference (TENCON)",
	"address":"Hong Kong",
	"date":"1-4 Nov. 2022",
	"url":"https://ieeexplore.ieee.org/document/9977906",
	"doi":"10.1109/TENCON55691.2022.9977906",
	"abstract":"Smart lamppost network is naturally formed by long segments of line networks where mesh is an overkill. We study the rapid deployment of cost-efficient non-mesh Wi-Fi backhaul with failover/failback mechanism.",
	"field":"misc"
},
"yin22_multiphase":{
	"title":"Multi-Phase Recoding for Batched Network Coding",
	"author":"<b>H. H. F. Yin</b> and M. Tahernia",
	"fullauthor":"<b>Hoover H. F. Yin</b>, Mehrdad Tahernia",
	"booktitle":"2022 IEEE Information Theory Workshop (ITW)",
	"address":"Mumbai, India",
	"date":"1-9 Nov. 2022",
	"url":"https://ieeexplore.ieee.org/document/9965849",
	"doi":"10.1109/ITW54588.2022.9965849",
	"pages":"25-30",
	"abstract":"Batched network coding is a practical realization of random linear network coding that resolves the issue of high computational and storage costs at the intermediate nodes by restricting recoding to the packets belonging to the same batch. Although there are various recoding approaches in the literature, they consider a one-shot approach which decides the number of recoded packets to be generated and transmits them without considering the reception status of these packets at the next node. In this paper, we divide the recoding process into multiple phases. In each phase, recoding depends on the amount of innovative information left at the current node after the transmission of the previous phases, where this knowledge can be obtained via feedback mechanism. This way, we can reduce the uncertainty during recoding and utilize the network more efficiently. We formulate the optimization problems for multi-phase adaptive recoding and show by simulation that two-phase recoding can already enhance the throughput significantly.",
	"field":"nc"
},
"yin22_prefix":{
	"title":"Multichannel Optimal Tree-Decodable Codes are Not Always Optimal Prefix Codes",
	"author":"<b>H. H. F. Yin</b>, H. W. H. Wong, M. Tahernia, and R. W. F. Lai",
	"fullauthor":"<b>Hoover H. F. Yin</b>, Harry W. H. Wong, Mehrdad Tahernia, Russell W. F. Lai",
	"booktitle":"2022 IEEE International Symposium on Information Theory (ISIT)",
	"address":"Espoo, Finland",
	"url":"https://ieeexplore.ieee.org/document/9834710",
	"doi":"10.1109/ISIT50566.2022.9834710",
	"date":"26 Jun.-1 Jul. 2022",
	"pages":"1-6",
	"abstract":"The theory of multichannel prefix codes aims to generalize the classical theory of prefix codes. Although single- and two-channel prefix codes always have decoding trees, the same cannot be said when there are more than two channels. One question is of theoretical interest: Do there exist optimal tree-decodable codes that are not optimal prefix codes? Existing literature, which focused on generalizing single-channel results, covered little about non-tree-decodable prefix codes since they have no single-channel counterparts. In this work, we study the fundamental reason behind the non-tree-decodability of prefix codes. By investigating the simplest non-tree-decodable structure, we obtain a general sufficient condition on the channel alphabets for the existence of optimal tree-decodable codes that are not optimal prefix codes.",
	"field":"it"
},
"yin22_pkt":{
	"title":"Packet Size Optimization for Batched Network Coding",
	"author":"<b>H. H. F. Yin</b>, H. W. H. Wong, M. Tahernia, and J. Qing",
	"fullauthor":"<b>Hoover H. F. Yin</b>, Harry W. H. Wong, Mehrdad Tahernia, Jiaxin Qing",
	"booktitle":"2022 IEEE International Symposium on Information Theory (ISIT)",
	"address":"Espoo, Finland",
	"url":"https://ieeexplore.ieee.org/document/9834338",
	"doi":"10.1109/ISIT50566.2022.9834338",
	"date":"26 Jun.-1 Jul. 2022",
	"pages":"1584-1589",
	"abstract":"Batched network coding (BNC) is a low-complexity variant of random linear network coding (RLNC) that encodes the file to be sent into batches, each consisting of a few coded packets. Although many works are focusing on the overhead reduction of RLNC, the overhead reduction for BNC is rarely studied. Different types of overheads in BNC interact and can potentially increase the overall overhead significantly. In this paper, we formulate a minimization problem for BNC on the number of symbols we need to send at the source node by tuning the number of packets divided from the file, which has the same meaning as tuning the packet size. It is hard to optimize the discrete zigzag-like objective efficiently. However, in practical scenarios, the encoder has to optimize the problem in real-time for different file size and redundancy requirements. We propose an efficient heuristic for this purpose and show its accuracy by numerical evaluations.",
	"field":"nc"
},
"qing22_ml":{
	"title":"Enhancing the Decoding Rates of BATS Codes by Learning With Guided Information",
	"author":"J. Qing, <b>H. H. F. Yin</b>, and R. W. Yeung",
	"fullauthor":"Jiaxin Qing, <b>Hoover H. F. Yin</b>, Raymond W. Yeung",
	"booktitle":"2022 IEEE International Symposium on Information Theory (ISIT)",
	"address":"Espoo, Finland",
	"url":"https://ieeexplore.ieee.org/document/9834581",
	"doi":"10.1109/ISIT50566.2022.9834581",
	"date":"26 Jun.-1 Jul. 2022",
	"pages":"37-42",
	"abstract":"BATched Sparse codes (BATS codes) are a class of random linear network code designed for wireless multi-hop networks with packet loss. The encoder of a BATS code generates batches where each batch contains a number of coded packets. As the outer code is a matrix generalization of the fountain code, the ordinary batch construction scheme relies on a degree distribution with a random packet sampling scheme. In practical applications, we want a batch construction scheme which achieves a high decoding rate at the destination. A natural question to ask is: Is there any batch construction scheme which achieves a higher decoding rate than the ordinary one? We give an affirmative answer to this question by formulating the batch construction scheme as a multi-armed bandit problem and solving it with a deep reinforcement learning method with the degree distribution as a guiding prior. The BATS code generated by our proposed method achieves a higher decoding rate with improved coding efficiency compared with the ordinary batch construction scheme.",
	"field":"nc"
},
"yin21_packing":{
	"title":"Polynomial-Time Construction of Two-Channel Prefix-Free Codes with Given Codeword Lengths",
	"author":"<b>H. H. F. Yin</b>, K. H. Ng, Y. T. Shing, R. W. F. Lai, and X. Wang",
	"fullauthor":"<b>Hoover H. F. Yin</b>, Ka Hei Ng, Yu Ting Shing, Russell W. F. Lai, Xishi Wang",
	"booktitle":"2021 IEEE Information Theory Workshop (ITW)",
	"address":"Kanazawa, Japan",
	"date":"17-21 Oct. 2021",
	"url":"https://ieeexplore.ieee.org/abstract/document/9611502",
	"doi":"10.1109/ITW48936.2021.9611502",
	"abstract":"Although n-channel prefix-free codes are natural extensions of their 1-channel counterpart, the extra dimensions greatly increase the complexity of the problem such that most classical results cannot be generalized directly. Recently, a greedy algorithm was developed for deciding if it is possible to construct a 2-channel prefix-free code from a given multiset of codeword lengths. By dropping the information about codeword assignments which are not necessary for the decision problem, the greedy algorithm runs in polynomial time. However, if we naively turn the decision algorithm into a search algorithm (for constructing a prefix-free code) by retaining the information about codeword assignments, the computational complexity becomes exponential. One puzzle left unsolved was that whether the search problem can also be solved in polynomial time. In this paper, we give an affirmative answer to this question by designing a tailor-made data structure and a new lazy evaluation technique.",
	"field":"it"
},
"yin21_innov":{
	"title":"Analysis of Innovative Rank of Batched Network Codes for Wireless Relay Networks",
	"author":"<b>H. H. F. Yin</b>, X. Xu, K. H. Ng, Y. L. Guan, and R. W. Yeung",
	"fullauthor":"<b>Hoover H. F. Yin</b>, Xiaoli Xu, Ka Hei Ng, Yong Liang Guan, Raymond W. Yeung",
	"booktitle":"2021 IEEE Information Theory Workshop (ITW)",
	"address":"Kanazawa, Japan",
	"date":"17-21 Oct. 2021",
	"url":"https://ieeexplore.ieee.org/abstract/document/9611427",
	"doi":"10.1109/ITW48936.2021.9611427",
	"abstract":"Wireless relay network is a solution for transmitting information from a source node to a sink node far away by installing a relay in between. The broadcasting nature of wireless communication allows the sink node to receive part of the data sent by the source node. In this way, the relay does not need to receive the whole piece of data from the source node and it does not need to forward everything it received. In this paper, we consider the application of batched network coding, a practical form of random linear network coding, for a better utilization of such a network. The amount of innovative information at the relay which is not yet received by the sink node, called the innovative rank, plays a crucial role in various applications including the design of the transmission scheme and the analysis of the throughput. We present a visualization of the innovative rank which allows us to understand and derive formulae related to the innovative rank with ease.",
	"field":"nc"
},
"yin21_huffman":{
	"title":"On Multi-Channel Huffman Codes for Asymmetric-Alphabet Channels",
	"author":"<b>H. H. F. Yin</b>, X. Wang, K. H. Ng, R. W. F. Lai, L. K. L. Ng, and J. P. K. Ma",
	"fullauthor":"<b>Hoover H. F. Yin</b>, Xishi Wang, Ka Hei Ng, Russell W. F. Lai, Lucien K. L. Ng, Jack P. K. Ma",
	"booktitle":"2021 IEEE International Symposium on Information Theory (ISIT)",
	"address":"Melbourne, Victoria, Australia",
	"date":"12-20 Jul. 2021",
	"pages":"2024-2029",
	"url":"https://ieeexplore.ieee.org/document/9517894",
	"doi":"10.1109/ISIT45174.2021.9517894",
	"abstract":"Zero-error single-channel source coding has been studied extensively over the past decades. Its natural multi-channel generalization is however seldom investigated. While the special case with multiple symmetric-alphabet channels was studied a decade ago, codes in such setting have no advantage over single-channel codes in data compression, making them worthless in most applications. With essentially no development since the last decade, in this paper, we break the stalemate by showing that it is possible to beat single-channel source codes in terms of compression assuming asymmetric-alphabet channels. We present the multi-channel analogs of several classical results in single-channel source coding, e.g., a multi-channel Huffman code is an optimal tree-decodable code. We also show evidences that finding an efficient construction of multi-channel Huffman codes may be hard. Nevertheless, we propose a construction whose redundancy is guaranteed to be no larger than that of an optimal single-channel source code.",
	"field":"it"
},
"wang21_inferred":{
	"title":"Small-Sample Inferred Adaptive Recoding for Batched Network Coding",
	"author":"J. Wang, Z. Jia, <b>H. H. F. Yin</b>, and S. Yang",
	"fullauthor":"Jie Wang, Zhiyuan Jia, <b>Hoover H. F. Yin</b>, Shenghao Yang",
	"booktitle":"2021 IEEE International Symposium on Information Theory (ISIT)",
	"address":"Melbourne, Victoria, Australia",
	"date":"12-20 Jul. 2021",
	"pages":"1427-1432",
	"url":"https://ieeexplore.ieee.org/document/9518091",
	"doi":"10.1109/ISIT45174.2021.9518091",
	"abstract":"Batched network coding is a low-complexity network coding solution to feedbackless multi-hop wireless packet network transmission with packet loss. The data to be transmitted is encoded into batches where each of which consists of a few coded packets. Unlike the traditional forwarding strategy, the intermediate network nodes have to perform recoding, which generates recoded packets by network coding operations restricted within the same batch. Adaptive recoding is a technique to adapt the fluctuation of packet loss by optimizing the number of recoded packets per batch to enhance the throughput. The input rank distribution, which is a piece of information regarding the batches arriving at the node, is required to apply adaptive recoding. However, this distribution is not known in advance in practice as the incoming link’s channel condition may change from time to time. On the other hand, to fully utilize the potential of adaptive recoding, we need to have a good estimation of this distribution. In other words, we need to guess this distribution from a few samples so that we can apply adaptive recoding as soon as possible. In this paper, we propose a distributionally robust optimization for adaptive recoding with a small-sample inferred prediction of the input rank distribution. We develop an algorithm to efficiently solve this optimization with the support of theoretical guarantees that our optimization’s performance would constitute as a confidence lower bound of the optimal throughput with high probability.",
	"field":"nc"
},
"yin21_loss":{
	"title":"Impact of Packet Loss Rate Estimation on Blockwise Adaptive Recoding for Batched Network Coding",
	"author":"<b>H. H. F. Yin</b> and K. H. Ng",
	"fullauthor":"<b>Hoover H. F. Yin</b>, Ka Hei Ng",
	"booktitle":"2021 IEEE International Symposium on Information Theory (ISIT)",
	"address":"Melbourne, Victoria, Australia",
	"date":"12-20 Jul. 2021",
	"pages":"1415-1420",
	"url":"https://ieeexplore.ieee.org/document/9518102",
	"doi":"10.1109/ISIT45174.2021.9518102",
	"abstract":"Batched network coding is a solution to reliable communications in multi-hop networks with packet loss. Adaptive recoding is a technique to enhance the throughput of batched network coding. Two pieces of information is needed to apply adaptive recoding: the distribution of the information remained in the received batches and the channel condition of the outgoing link. A simple way to obtain the former information is to make a short observation by grouping a few batches into a block. This way to apply adaptive recoding is called blockwise adaptive recoding (BAR), which can achieve a nice throughput even when the block size is small. Previous literature assumes that the latter information is known in advance and would not be changed over time. However in practice, these assumptions do not hold in general. In this paper, we investigate the impact of inaccurate channel condition on BAR and show by numerical evaluations that the throughput is very close to the one with accurate channel condition. To adapt the varying channel condition, we also propose a feedback scheme for BAR and a method to reduce the computational time for BAR.",
	"field":"nc"
},
"yin21_intrablock":{
	"title":"Intrablock Interleaving for Batched Network Coding with Blockwise Adaptive Recoding",
	"author":"<b>H. H. F. Yin</b>, K. H. Ng, A. Z. Zhong, R. W. Yeung, and S. Yang",
	"fullauthor":"<b>Hoover H. F. Yin</b>, Ka Hei Ng, Allen Z. Zhong, Raymond W. Yeung, Shenghao Yang",
	"booktitle":"2021 IEEE International Symposium on Information Theory (ISIT)",
	"address":"Melbourne, Victoria, Australia",
	"date":"12-20 Jul. 2021",
	"pages":"1409-1414",
	"url":"https://ieeexplore.ieee.org/document/9517910",
	"doi":"10.1109/ISIT45174.2021.9517910",
	"abstract":"Batched network coding (BNC) is a low-complexity solution to network transmission in feedbackless multi-hop packet networks with packet loss. BNC encodes the source data into batches of packets. As a network coding scheme, the intermediate nodes perform recoding on the received packets instead of just forwarding them. Blockwise adaptive recoding (BAR) is a recoding strategy which can enhance the throughput and adapt real-time changes in the incoming channel condition. In wireless applications, in order to combat burst packet loss, interleavers can be applied for BNC in a hop-by-hop manner. In particular, a batch-stream interleaver that permutes packets across blocks can be applied with BAR to further boost the throughput. However, the previously proposed minimal communication protocol for BNC only supports permutation of packets within a block, called intrablock interleaving, and so it is not compatible with the batch-stream interleaver. In this paper, we design an intrablock interleaver for BAR that is backward compatible with the aforementioned minimal protocol, so that the throughput can be enhanced without upgrading all the existing devices.",
	"field":"nc"
},
"yin20_buffer":{
	"title":"On the Memory Requirements of Block Interleaver for Batched Network Codes",
	"author":"<b>H. H. F. Yin</b>, K. H. Ng, X. Wang, Q. Cao, and L. K. L. Ng",
	"fullauthor":"<b>Hoover H. F. Yin</b>, Ka Hei Ng, Xishi Wang, Qi Cao, Lucien K. L. Ng",
	"booktitle":"2020 IEEE International Symposium on Information Theory (ISIT)",
	"address":"Los Angeles, CA, USA",
	"date":"21-26 Jun. 2020",
	"pages":"1658-1663",
	"url":"https://ieeexplore.ieee.org/document/9174517",
	"doi":"10.1109/ISIT44484.2020.9174517",
	"abstract":"Batched network coding is a practical branch of random linear network coding which encodes the input file into small batches of coded packets. Although burst erasures within the batches can reduce the advantage of network coding, it can be alleviated by applying a block interleaver which spreads the burst across multiple batches. On the other hand, the intermediate network nodes are required to perform recoding on the batches unlike the traditional forwarding strategy. The recoding of a batch can be started once all the packets in that batch which are not dropped by the channel are received. This means that the intermediate network nodes have to deinterleave the batches for recoding and reinterleave the batches again for transmission, which gives us a choice to use different interleaver depths at different network nodes. In this paper, we study the memory requirements of the schemes for transmitting batches which apply different interleaver depths. We investigate the periodic structure of buffer sizes and the connection between buffer sizes and the total delay induced by the interleaver. More importantly, we show that there exists a scheme which can achieve the lowest memory requirement and minimum total delay simultaneously.",
	"field":"nc"
},
"dong20_num":{
	"title":"Network Utility Maximization for BATS Code Enabled Multihop Wireless Networks",
	"author":"Y. Dong, S. Jin, S. Yang, and <b>H. H. F. Yin</b>",
	"fullauthor":"Yanyan Dong, Sheng Jin, Shenghao Yang, <b>Hoover H. F. Yin</b>",
	"booktitle":"2020 IEEE International Conference on Communications (ICC): Mobile and Wireless Networks Symposium (IEEE ICC'20 - MWN Symposium)",
	"address":"Dublin, Ireland",
	"date":"7-11 Jun. 2020",
	"url":"https://ieeexplore.ieee.org/document/9148834",
	"doi":"10.1109/ICC40277.2020.9148834",
	"abstract":"Network utility maximization (NUM) is studied for multihop wireless networks employing an efficient random linear network coding scheme called BATS codes. Compared with the classical random linear network coding scheme, BATS codes have lower computational and storage costs at the intermediate network nodes, and can achieve close-to-optimal end-to-end throughput and latency for multihop networks with packet loss. We formulate a NUM problem that optimizes the total utility of multiple communication flows under certain link scheduling constraints. Our problem employs a practical throughput measure induced by BATS codes and hence can provide realistic guidelines about network protocol designs for multihop wireless networks. Our problem in general has a non-convex objective function with integer variables, so that the algorithms of solving existing network utility maximization problems cannot be directly applied to our problem. We discuss a modified dual-based algorithm for solving our problem and evaluate its performance numerically.",
	"field":"nc"
},
"yin19_packing":{
	"title":"Decision Procedure for the Existence of Two-Channel Prefix-Free Codes",
	"author":"<b>H. H. F. Yin</b>, K. H. Ng, Y. T. Shing, R. W. F. Lai, and X. Wang",
	"fullauthor":"<b>Hoover H. F. Yin</b>, Ka Hei Ng, Yu Ting Shing, Russell W. F. Lai, Xishi Wang",
	"booktitle":"2019 IEEE International Symposium on Information Theory (ISIT)",
	"address":"Paris, France",
	"date":"7-12 Jul. 2019",
	"pages":"1522-1526",
	"url":"https://ieeexplore.ieee.org/document/8849758",
	"doi":"10.1109/ISIT.2019.8849758",
	"abstract":"The Kraft inequality gives a necessary and sufficient condition for the existence of a single channel prefix-free code. However, the multichannel Kraft inequality does not imply the existence of a multichannel prefix-free code in general. It is natural to ask whatever there exists an efficient decision procedure for the existence of multichannel prefix-free codes. In this paper, we tackle the two-channel case of the above problem by relating it to a constrained rectangle packing problem. Although a general rectangle packing problem is NP-complete, the extra imposed constraints allow us to propose an algorithm which can solve the problem efficiently.",
	"field":"it"
},
"yin19_rf":{
	"title":"Packet Efficiency of BATS Coding on Wireless Relay Network with Overhearing",
	"author":"<b>H. H. F. Yin</b>, X. Xu, K. H. Ng, Y. L. Guan, and R. W. Yeung",
	"fullauthor":"<b>Hoover H. F. Yin</b>, Xiaoli Xu, Ka Hei Ng, Yong Liang Guan, Raymond W. Yeung",
	"booktitle":"2019 IEEE International Symposium on Information Theory (ISIT)",
	"address":"Paris, France",
	"date":"7-12 Jul. 2019",
	"pages":"1967-1971",
	"url":"https://ieeexplore.ieee.org/document/8849280",
	"doi":"10.1109/ISIT.2019.8849280",
	"abstract":"BATS codes are a class of random linear network coding scheme which have close-to-optimal achievable rates, while adaptive recoding is a packet combining scheme which adds a boost to the throughput by adapting the packet combining at the relay to the random fluctuations in the number of erasures in individual batches. In this paper, we apply BATS code with adaptive recoding for the transmission on wireless relay network. In contrast to the existing adaptive recoding schemes, we propose a model which can make use of the broadcast nature of wireless communication to enhance the achievable rates via overhearing. We also optimize the packet efficiency, i.e., minimizing the average number of channel use for each input packet for a successful decoding.",
	"field":"nc"
},
"yin19_uni":{
	"title":"A Unified Adaptive Recoding Framework for Batched Network Coding",
	"author":"<b>H. H. F. Yin</b>, B. Tang, K. H. Ng, S. Yang, X. Wang, and Q. Zhou",
	"fullauthor":"<b>Hoover H. F. Yin</b>, Bin Tang, Ka Hei Ng, Shenghao Yang, Xishi Wang, Qiaoqiao Zhou",
	"booktitle":"2019 IEEE International Symposium on Information Theory (ISIT)",
	"address":"Paris, France",
	"date":"7-12 Jul. 2019",
	"pages":"1962-1966",
	"url":"https://ieeexplore.ieee.org/document/8849277",
	"doi":"10.1109/ISIT.2019.8849277",
	"abstract":"Batched network coding is a variation of random linear network coding which has low computational and storage costs. In order to adapt random fluctuations in the number of erasures in individual batches, it is not optimal to recode and transmit the same number of packets for all batches. Different distributed optimization problems, which are called adaptive recoding, were formulated for this purpose. The key component of these optimization problems is the expected value of the rank distribution of a batch at the next network node, which also known as the expected rank. In this paper, we put forth a unified adaptive recoding framework. We show that the expected rank functions are concave when the packet loss pattern follows a stationary stochastic process regardless of the field size, which covers but not limited to independent packet loss and burst packet loss. Under this concavity property, we show that there always exists a preferred solution which not only can make the number of recoded packets almost deterministic but can also tolerate rank distribution errors due to inaccurate measurements or limited precision of the machine. To obtain such an optimal solution, we propose tuning schemes that can turn any feasible solution into one with the above desired properties.",
	"field":"nc"
},
"yin19_delay":{
	"title":"On the Minimum Delay of Block Interleaver for Batched Network Codes",
	"author":"<b>H. H. F. Yin</b>, K. H. Ng, X. Wang, and Q. Cao",
	"fullauthor":"<b>Hoover H. F. Yin</b>, Ka Hei Ng, Xishi Wang, Qi Cao",
	"booktitle":"2019 IEEE International Symposium on Information Theory (ISIT)",
	"address":"Paris, France",
	"date":"7-12 Jul. 2019",
	"pages":"1957-1961",
	"url":"https://ieeexplore.ieee.org/document/8849519",
	"doi":"10.1109/ISIT.2019.8849519",
	"abstract":"Batched network coding is a practical realization of random linear network coding, which encodes the packets for transmission into small batches of coded packets. The advantage of network coding can be reduced when a burst loss occurs. Block interleaver is one of the approach to spread the burst across multiple batches. However, an intermediate node has to receive all the packets in a batch which are not dropped by the channel before it can perform recoding on the batch, which means that the node has to deinterleave for recoding and reinterleave again for transmission. This gives us the freedom to select heterogeneous interleaver depth among the intermediate nodes. In general, the larger the interleaver depth, the better the spread of the bursts. On the other hand, we want the delay as short as possible to enable real-time applications. In this paper, we investigate the delay induced by applying a block interleaver on batched network codes. We also show that a homogeneous interleaver depth is the largest interleaver depth we can use to achieve a minimum delay.",
	"field":"nc"
},
"yin16_adaptive":{
	"title":"Adaptive Recoding for BATS Codes",
	"author":"<b>H. H. F. Yin</b>, S. Yang, Q. Zhou, and L. M. L. Yung",
	"fullauthor":"<b>Hoover H. F. Yin</b>, Shenghao Yang, Qiaoqiao Zhou, Lily M. L. Yung",
	"booktitle":"2016 IEEE International Symposium on Information Theory (ISIT)",
	"address":"Barcelona, Spain",
	"date":"10-15 Jul. 2016",
	"pages":"2349-2353",
	"url":"https://ieeexplore.ieee.org/document/7541719",
	"doi":"10.1109/ISIT.2016.7541719",
	"abstract":"BATS codes were proposed for communication through networks with packet loss. A BATS code consists of an outer code and an inner code. The outer code is a matrix generalization of fountain codes, which works with the inner code that comprises random linear network coding at the intermediate network nodes. In this paper, we propose a new inner code scheme for BATS codes, called adaptive recoding, which can be applied distributively at the intermediate network nodes, requiring only local knowledge of the received packets and the outgoing network link erasure probability. We show that adaptive recoding has significant throughput gain for relatively small batch sizes, compared with the baseline recoding scheme used in existing works.",
	"field":"nc"
},
"yang14_pro1":{
	"title":"BATS: Network Coding in Action",
	"author":"S. Yang, R. W. Yeung, J. H. F. Cheung, and <b>H. H. F. Yin</b>",
	"fullauthor":"Shenghao Yang, Raymond W. Yeung, Jay H. F. Cheung, <b>Hoover H. F. Yin</b>",
	"booktitle":"2014 52nd Annual Allerton Conference on Communication, Control, and Computing (Allerton)",
	"address":"Monticello, IL, USA",
	"date":"30 Sept.-3 Oct. 2014",
	"pages":"1204-1211",
	"url":"https://ieeexplore.ieee.org/document/7028592",
	"doi":"10.1109/ALLERTON.2014.7028592",
	"abstract":"BATS code is a low-complexity random linear network coding scheme that can achieve asymptotic bandwidth optimality for many types of networks with packet loss. In this paper, we propose a BATS code based network protocol and evaluate the performance by real-device experiments. Our results demonstrate significant ready-to-implement gain of network coding over forwarding in multi-hop network transmission with packet loss. We also propose an improved protocol to handle the practical issues observed in the experiments.",
	"field":"nc"
}
}

