{
"yin23_sd":{
	"title":"Discrete Analogue of Fishburn's Fractional-Order Stochastic Dominance",
	"author":"<b>H. H. F. Yin</b>, X. Wang, H. W. L. Mak, C. S. Au Yong, and I. Y. Y. Chan",
	"fullauthor":"<b>Hoover H. F. Yin</b>, Xishi Wang, Hugo Wai Leung Mak, Chun Sang Au Yong, Ian Y. Y. Chan",
	"journal":"Axioms",
	"volume":"12",
	"number":"6",
	"paper":"564",
	"date":"Jun. 2023",
	"url":"https://www.mdpi.com/2075-1680/12/6/564",
	"doi":"10.3390/axioms12060564",
	"abstract":"A stochastic dominance (SD) relation can be defined by two different perspectives: One from the view of distributions, and the other one from the view of expected utilities. In the early days, Fishburn investigated SD from the view of distributions, and we refer this perspective as Fishburn’s SD. One of his many results was the development of fractional-order SD for continuous distributions. However, discrete fractional-order SD cannot be directly generalized, because some properties of fractional calculus may not possess a discrete counterpart. In this paper, we develop a discrete analogue of fractional-order SD for discrete utilities from the view of distributions. We generalize the order of SD by Lizama’s fractional delta operator, show the preservation of SD hierarchy, and formulate the utility classes that are congruent with our SD relations. This work brings a message that some results of discrete SD cannot be directly generalized from continuous SD. We characterize the difference between discrete and continuous fractional-order SD, as well as the way to handle it for further applications in mathematics and computer science.",
	"field":"misc"
},
"mak23_vae":{
	"title":"Application of Variational AutoEncoder (VAE) Model and Image Processing Approaches in Game Design",
	"author":"H. W. L. Mak, R. Han, and <b>H. H. F. Yin</b>",
	"fullauthor":"Hugo Wai Leung Mak, Runze Han, <b>Hoover H. F. Yin</b>",
	"journal":"Sensors",
	"volume":"23",
	"number":"7",
	"paper":"3457",
	"date":"Mar. 2023",
	"url":"https://www.mdpi.com/1424-8220/23/7/3457",
	"doi":"10.3390/s23073457",
	"abstract":"In recent decades, the Variational AutoEncoder (VAE) model has shown good potential and capability in image generation and dimensionality reduction. The combination of VAE and various machine learning frameworks has also worked effectively in different daily life applications, however its possible use and effectiveness in modern game design has seldom been explored nor assessed. The use of its feature extractor for data clustering has also been minimally discussed in the literature neither. This study first attempts to explore different mathematical properties of the VAE model, in particular, the theoretical framework of the encoding and decoding processes, the possible achievable lower bound and loss functions of different applications; then applies the established VAE model to generate new game levels based on two well-known game settings; and to validate the effectiveness of its data clustering mechanism with the aid of the Modified National Institute of Standards and Technology (MNIST) database. Respective statistical metrics and assessments are also utilized to evaluate the performance of the proposed VAE model in aforementioned case studies. Based on the statistical and graphical results, several potential deficiencies, for example, difficulties in handling high-dimensional and vast datasets, as well as insufficient clarity of outputs are discussed; then measures of future enhancement, such as tokenization and the combination of VAE and GAN models, are also outlined. Hopefully, this can ultimately maximize the strengths and advantages of VAE for future game design tasks and relevant industrial missions.",
	"field":"misc"
},
"yang22_ojvt":{
	"title":"On Scalable Network Communication for Infrastructure-Vehicle Collaborative Autonomous Driving",
	"author":"S. Yang, <b>H. H. F. Yin</b>, R. W. Yeung, X. Xiong, Y. Huang, L. Ma, M. Li, and C. Tang",
	"fullauthor":"Shenghao Yang, <b>Hoover H. F. Yin</b>, Raymond W. Yeung, Xi Xiong, Yanlong Huang, Lingfei Ma, Mo Li, Chaoyang Tang",
	"journal":"IEEE Open Journal of Vehicular Technology (OJVT)",
	"volume":"4",
	"pages":"310-324",
	"date":"2023",
	"url":"https://ieeexplore.ieee.org/abstract/document/9969877",
	"doi":"10.1109/OJVT.2022.3226606",
	"abstract":"Network communication is crucial for Infrastructure-Vehicle Cooperative Autonomous Driving (IVCAD), which can help to improve both driving safety and efficiency. Existing IVCAD systems either use RoadSide Units (RSUs) deployed sparsely in critical locations to extend the on-board sensing, or use RSUs deployed densely in a limited area to provide both sensing and decision-making for vehicles. For both scenarios, the numbers of RSUs and vehicles are small, and the network communication solutions are based on the existing wireline and cellular network infrastructures and their extensions. However, it remains unknown whether these existing network communication solutions are scalable when the IVCAD system is deployed city-widely with hundreds of thousands of RSUs and millions of vehicles. In this paper, we analyze the network communication requirements for different types of IVCAD systems, and show that when the numbers of RSUs and vehicles in the system are large, using the existing solutions to support IVCAD can incur very high extra network communication facility cost. We further discuss how to use wireless mesh networks formed by RSUs themselves to solve the network communication problem without any deployment of extra network communication facilities. To enable the RSU network, we provide a network communication framework based on network coding and highlight some research directions.",
	"field":"misc"
},
"yin22_alien":{
	"title":"Two-State Alien Tiles: A Coding-Theoretical Perspective",
	"author":"<b>H. H. F. Yin</b>, K. H. Ng, S. K. Ma, H. W. H. Wong, and H. W. L. Mak",
	"fullauthor":"<b>Hoover H. F. Yin</b>, Ka Hei Ng, Shi Kin Ma, Harry W. H. Wong, Hugo Wai Leung Mak",
	"journal":"Mathematics",
	"volume":"10",
	"number":"16",
	"paper":"2994",
	"date":"Aug. 2022",
	"url":"https://www.mdpi.com/2227-7390/10/16/2994",
	"doi":"10.3390/math10162994",
	"abstract":"Most studies on the switching game Lights Out and its variants focus on the solvability of given games or the number of solvable games, but when the game is viewed in a coding-theoretical perspective, more interesting questions with special symbolizations in coding theory will naturally pop up, such as finding the minimal number of lit lights among all solvable games apart from the solved game, or finding the minimal number of lit lights that the player can achieve from a given unsolvable game, etc. However, these problems are usually hard to solve in general from the perspective of algorithmic complexity. This study considers a Lights Out variant called two-state Alien Tiles, which toggles all the lights in the same row and those in the same column of the clicked light. We investigate its properties, discuss several coding-theoretical problems about this game, and explore this game as an error-correcting code and investigate its optimality. The purpose of this paper is to propose ways of playing switching games in a think-outside-the-box manner, which benefits the recreational mathematics community.",
	"field":"misc"
},
"egger22_ring":{
	"title":"On Defeating Graph Analysis of Anonymous Transactions",
	"author":"C. Egger, R. W. F. Lai, V. Ronge, I. K. Y. Woo, and <b>H. H. F. Yin</b>",
	"fullauthor":"Christoph Egger, Russell W. F. Lai, Viktoria Ronge, Ivy K. Y. Woo, <b>Hoover H. F. Yin</b>",
	"journal":"Proceedings on Privacy Enhancing Technologies (PoPETs)",
	"volume":"3",
	"date":"Jul. 2022",
	"pages":"538-557",
	"url":"https://petsymposium.org/popets/2022/popets-2022-0085.php",
	"doi":"10.56553/popets-2022-0085",
	"abstract":"In a ring-signature-based anonymous cryptocurrency, signers of a transaction are hidden among a set of potential signers, called a ring, whose size is much smaller than the number of all users. The ringmembership relations specified by the sets of transactions thus induce bipartite transaction graphs, whose distribution is in turn induced by the ring sampler underlying the cryptocurrency. Since efficient graph analysis could be performed on transaction graphs to potentially deanonymise signers, it is crucial to understand the resistance of (the transaction graphs induced by) a ring sampler against graph analysis. Of particular interest is the class of partitioning ring samplers. Although previous works showed that they provide almost optimal local anonymity, their resistance against global, e.g. graph-based, attacks were unclear. In this work, we analyse transaction graphs induced by partitioning ring samplers. Specifically, we show (partly analytically and partly empirically) that, somewhat surprisingly, by setting the ring size to be at least logarithmic in the number of users, a graph-analysing adversary is no better than the one that performs random guessing in deanonymisation up to constant factor of 2.",
	"field":"misc"
},
"yin21_uni_j":{
	"title":"A Unified Adaptive Recoding Framework for Batched Network Coding",
	"author":"<b>H. H. F. Yin</b>, B. Tang, K. H. Ng, S. Yang, X. Wang, and Q. Zhou",
	"fullauthor":"<b>Hoover H. F. Yin</b>, Bin Tang, Ka Hei Ng, Shenghao Yang, Xishi Wang, Qiaoqiao Zhou",
	"journal":"IEEE Journal on Selected Areas in Information Theory (JSAIT)",
	"volume":"2",
	"number":"4",
	"date":"Dec. 2021",
	"pages":"1150-1164",
	"url":"https://ieeexplore.ieee.org/document/9627730",
	"doi":"10.1109/JSAIT.2021.3126634",
	"abstract":"Batched network coding is a variation of random linear network coding which has low computational and storage costs. In order to adapt to random fluctuations in the number of erasures in individual batches, it is not optimal to recode and transmit the same number of packets for all batches. Different distributed optimization models, which are called adaptive recoding schemes, were formulated for this purpose. The key component of these optimization problems is the expected value of the rank distribution of a batch at the next network node, which is also known as the expected rank. In this paper, we put forth a unified adaptive recoding framework with an arbitrary recoding field size. We show that the expected rank functions are concave when the packet loss pattern is a stationary stochastic process, which covers but not limited to independent packet loss and Gilbert-Elliott packet loss model. Under this concavity assumption, we show that there always exists a solution which not only can minimize the randomness on the number of recoded packets but also can tolerate rank distribution errors due to inaccurate measurements or limited precision of the machine. We provide an algorithm to obtain such an optimal solution, and propose tuning schemes that can turn any feasible solution into a desired optimal solution.",
	"field":"nc"
},
"yin21_intrablock_j":{
	"title":"Intrablock Interleaving for Batched Network Coding with Blockwise Adaptive Recoding",
	"author":"<b>H. H. F. Yin</b>, K. H. Ng, A. Z. Zhong, R. W. Yeung, S. Yang, and I. Y. Y. Chan",
	"fullauthor":"<b>Hoover H. F. Yin</b>, Ka Hei Ng, Allen Z. Zhong, Raymond W. Yeung, Shenghao Yang, Ian Y. Y. Chan",
	"journal":"IEEE Journal on Selected Areas in Information Theory (JSAIT)",
	"volume":"2",
	"number":"4",
	"date":"Dec. 2021",
	"pages":"1135-1149",
	"url":"https://ieeexplore.ieee.org/document/9627735",
	"doi":"10.1109/JSAIT.2021.3126647",
	"abstract":"Batched network coding (BNC) is a low-complexity solution to network transmission in multi-hop packet networks with packet loss. BNC encodes the source data into batches of packets. As a network coding scheme, the intermediate nodes perform recoding on the received packets belonging to the same batch instead of just forwarding them. A recoding scheme that may generate more recoded packets for batches of a higher rank is also called adaptive recoding. Meanwhile, in order to combat burst packet loss, the transmission of a block of batches can be interleaved. Stream interleaving studied in literature achieves the maximum separation among any two consecutive packets of a batch, but permutes packets across blocks and hence cannot bound the buffer size and the latency. To resolve the issue of stream interleaver, we design an intrablock interleaver for adaptive recoding that can preserve the advantages of using a block interleaver when the number of recoded packets is the same for all batches. We use potential energy in classical mechanics to measure the performance of an interleaver, and propose an algorithm to optimize the interleaver with this performance measure. Our problem formulation and algorithm for intrablock interleaving are also of independent interest.",
	"field":"nc"
},
"dong21_num_j":{
	"title":"Utility Maximization for Multihop Wireless Networks Employing BATS Codes",
	"author":"Y. Dong, S. Jin, Y. Chen, S. Yang, and <b>H. H. F. Yin</b>",
	"fullauthor":"Yanyan Dong, Sheng Jin, Yanzuo Chen, Shenghao Yang, <b>Hoover H. F. Yin</b>",
	"journal":"IEEE Journal on Selected Areas in Information Theory (JSAIT)",
	"volume":"2",
	"number":"4",
	"date":"Dec. 2021",
	"pages":"1120-1134",
	"url":"https://ieeexplore.ieee.org/document/9627725",
	"doi":"10.1109/JSAIT.2021.3126426",
	"abstract":"BATS (BATched Sparse) codes are a class of efficient random linear network coding variation that has been studied for multihop wireless networks mostly in scenarios of a single communication flow. Towards sophisticated multi-flow network communications, we formulate a network utility maximization (NUM) problem that jointly optimizes the BATS code parameters of all the flows and network scheduling. The NUM problem adopts a batch-wise packet loss model that can be obtained from the network local statistics without any constraints on packet loss patterns. Moreover, the NUM problem allows a different number of recoded packets to be transmitted for different batches in a flow, which is called adaptive recoding. Due to both the probably nonconcave objective and the BATS code-related variables, the algorithms developed for the existing flow optimization problems cannot be applied directly to solve our NUM problem. We introduce a two-step algorithm to solve our NUM problem, where the first step solves the problem with nonadaptive recoding schemes, and the second step optimizes adaptive recoding hop-by-hop from upstream to downstream in each flow. We perform various numerical evaluations and simulations to verify the effectiveness and efficiency of the algorithm.",
	"field":"nc"
},
"ronge21_ring":{
	"title":"Foundations of Ring Sampling",
	"author":"V. Ronge, C. Egger, R. W. F. Lai, D. Schröder, and <b>H. H. F. Yin</b>",
	"fullauthor":"Viktoria Ronge, Christoph Egger, Russell W. F. Lai, Dominique Schröder, <b>Hoover H. F. Yin</b>",
	"journal":"Proceedings on Privacy Enhancing Technologies (PoPETs)",
	"volume":"3",
	"date":"Jul. 2021",
	"pages":"265-288",
	"url":"https://petsymposium.org/popets/2021/popets-2021-0047.php",
	"doi":"10.2478/popets-2021-0047",
	"abstract":"A ring signature scheme allows the signer to sign on behalf of an ad hoc set of users, called a ring. The verifier can be convinced that a ring member signs, but cannot point to the exact signer. Ring signatures have become increasingly important today with their deployment in anonymous cryptocurrencies. Conventionally, it is implicitly assumed that all ring members are equally likely to be the signer. This assumption is generally false in reality, leading to various practical and devastating deanonymizing attacks in Monero, one of the largest anonymous cryptocurrencies. These attacks highlight the unsatisfactory situation that how a ring should be chosen is poorly understood.<p>We propose an analytical model of ring samplers towards a deeper understanding of them through systematic studies. Our model helps to describe how anonymous a ring sampler is with respect to a given signer distribution as an information-theoretic measure. We show that this measure is robust, in the sense that it only varies slightly when the signer distribution varies slightly. We then analyze three natural samplers – uniform, mimicking, and partitioning – under our model with respect to a family of signer distributions modeled after empirical Bitcoin data. We hope that our work paves the way towards researching ring samplers from a theoretical point of view.",
	"field":"misc"
},
"yin20_protocol":{
	"title":"A Protocol Design Paradigm for Batched Sparse Codes",
	"author":"<b>H. H. F. Yin</b>, R. W. Yeung, and S. Yang",
	"fullauthor":"<b>Hoover H. F. Yin</b>, Raymond W. Yeung, Shenghao Yang",
	"journal":"Entropy",
	"volume":"22",
	"number":"7",
	"paper":"790",
	"date":"Jul. 2020",
	"url":"https://www.mdpi.com/1099-4300/22/7/790",
	"doi":"10.3390/e22070790",
	"abstract":"Internet of Things (IoT) connects billions of everyday objects to the Internet. The mobility of devices can be facilitated by means of employing multiple wireless links. However, packet loss is a common phenomenon in wireless communications, where the traditional forwarding strategy undergoes severe performance issues in a multi-hop wireless network. One solution is to apply batched sparse (BATS) codes. A fundamental difference from the traditional strategy is that BATS codes require the intermediate network nodes to perform recoding, which generates recoded packets by network coding operations. Literature showed that advanced recoding schemes and burst packet loss can enhance and diminish the performance of BATS codes respectively. However, the existing protocols for BATS codes cannot handle both of them at the same time. In this paper, we propose a paradigm of protocol design for BATS codes. Our design can be applied in different layers of the network stack and it is compatible to the existing network infrastructures. The modular nature of the protocol can support different recoding techniques and different ways to handle burst packet loss. We also give some examples to demonstrate how to use the protocol.",
	"field":"nc"
},
"zhou17_var":{
	"title":"On BATS Codes With Variable Batch Sizes",
	"author":"Q. Zhou, S. Yang, <b>H. H. F. Yin</b>, and B. Tang",
	"fullauthor":"Qiaoqiao Zhou, Shenghao Yang, <b>Hoover H. F. Yin</b>, Bin Tang",
	"journal":"IEEE Communications Letters", 
	"volume":"21",
	"number":"9",
	"date":"Sept. 2017",
	"pages":"1917-1920",
	"url":"https://ieeexplore.ieee.org/document/7944646",
	"doi":"10.1109/LCOMM.2017.2713813",
	"abstract":"BATS codes are a class of low complexity random linear network codes with high throughput. In a previous work, BATS codes were generalized to incorporate batches of different sizes, and a sufficient condition was obtained such that the belief propagation decoding can recover a given fraction of the input packets with high probability. In this paper, by investigating an optimization problem induced by the sufficient condition, we derive a condition such that it is optimal to use a constant batch size. This condition gives us a guideline for designing practical network protocol based on BATS codes. Moreover, we prove that this condition is always satisfied in line networks.",
	"field":"nc"
}
}

