{
"yin25_intrablock_cn":{
	"title":"用于通信网络的兼容分组分离",
	"title2":"Compatible Packet Separation for Communication Networks",
	"author":"<b>殷浩辉</b>, 伍家曦, 锺卓炜, 杨伟豪, 杨升浩",
	"fullauthor":"<b>殷浩辉</b>, 伍家曦, 锺卓炜, 杨伟豪, 杨升浩",
	"address":"CN",
	"pubDate":"2025.05.30",
	"number":"115189802",
	"filedDate":"2021.04.01",
	"appNumber":"202110354424.8",
	"url":"https://patents.google.com/patent/CN115189802A",
	"abstract":"本文描述了用于通信网络的兼容分组分离的系统、方法和其它技术。接收包括要在网络上传输的多个分组的块。该块包括一组批量数据，并且多个分组分布在一组批量数据之间。计算一组批量数据中的每个批量数据的伪交织器深度，以产生一组伪交织器深度。使用一组伪交织器深度来执行分块自适应重编码，以产生一组批量数据中的每个批量数据的多个重编码分组。使用一组批量数据中的每个批量数据的多个重编码分组来产生传输序列。"
},
"yin22_multi_us":{
	"title":"Systems and Methods for Multi-Phase Recoding for Batched Network Coding",
	"author":"<b>H. F. H. Yin</b> and M. Tahernia",
	"fullauthor":"<b>Ho Fai Hoover Yin</b>, Mehrdad Tahernia",
	"address":"US",
	"pubDate":"February 11, 2025",
	"number":"12,224,929",
	"filedDate":"September 9, 2022",
	"appNumber":"17/941,921",
	"url":"https://patents.google.com/patent/US12224929B2/",
	"abstract":"Systems, methods, apparatuses, and techniques for multi-phase recoding with respect to batched network coding (BNC) are described.  In operation of a multi-phase recoding technique a first node in a multi-hop wireless network data communication path between a source node and a destination node provides recoding and transmission of packets of a BNC batch to a second node in the communication path via multiple phases.  Multi-phase recoding makes use of the reception status of the recoded packets that have been received by the second node in earlier phases of multi-phase recoding operation with respect to transmission of a particular batch.  Multi-phase recoding feedback from the second node to the first node may be provided so that the first node can determine how many recoded packets are to be sent in the next phase of multi-phase recoding operation."
},
"yin22_pktsize_us":{
	"title":"Systems and Methods for Optimizing Network Transmissions",
	"author":"<b>H. F. H. Yin</b>",
	"fullauthor":"<b>Ho Fai Hoover Yin</b>",
	"address":"US",
	"pubDate":"February 17, 2024",
	"number":"12,170,924",
	"filedDate":"April 20, 2022",
	"appNumber":"17/725,524",
	"url":"https://patents.google.com/patent/US12170924B2/",
	"abstract":"Batched network coding (BNC) is a low-complexity solution to network transmission in multi-hop networks with packet loss that divides data to be transmitted into multiple packets and pads the data when necessary. However, an inappropriate choice of packet size leads to a significant overhead. Embodiments of the present disclosure provide systems, methods, and apparatuses that overcome the shortcomings of traditional BNC solutions by dynamically deciding a packet size through optimization of the overhead. As a result, embodiments of the present disclosure boost throughput of systems leveraging BNC transmission techniques by providing file-specific and dynamically determined optimizations. The disclosed techniques for performing dynamic optimization of transmissions also reduce computational complexity, enabling use case deployments in which nodes having reduced computational resources and power requirements are utilized while maintaining improved performance of the network (e.g., in terms of throughput, etc.)."
},
"yin23_multi_cn":{
	"title":"用于分批网络编码的多阶段重新编码的系统和方法",
	"author":"<b>殷浩辉</b>, 迈赫达德·塔赫尼亚",
	"fullauthor":"<b>殷浩辉</b>, 迈赫达德·塔赫尼亚",
	"address":"CN",
	"filedDate":"2023.09.08",
	"appNumber":"202311157694",
	"url":"https://patents.google.com/patent/CN117692653A/",
	"abstract":"描述了与分批网络编码(BNC)有关的多阶段重新编码的系统、方法、装置和技术。在多阶段重新编码技术的操作中，多跳无线网络数据通信路径中在源节点和目的节点之间的第一节点经由多个阶段向通信路径中的第二节点提供BNC批次的数据包的重新编码和传输。多阶段重新编码了利用第二节点在关于特定批次的传输的多阶段重新编码操作的早期阶段接收到的重新编码数据包的接收状态。可以提供从第二节点到第一节点的多阶段重新编码反馈，使得第一节点能够确定在多阶段重新编码操作的下一阶段要发送多少个重新编码数据包。"
},
"yin23_multi_ep":{
	"title":"Systems and Methods for Multi-Phase Recoding for Batched Network Coding",
	"author":"<b>H. F. H. Yin</b> and M. Tahernia",
	"fullauthor":"<b>Ho Fai Hoover Yin</b>, Mehrdad Tahernia",
	"address":"EP",
	"filedDate":"August 24, 2023",
	"appNumber":"23193083",
	"url":"https://patents.google.com/patent/EP4336757A1/",
	"abstract":"Systems, methods, apparatuses, and techniques for multi-phase recoding with respect to batched network coding (BNC) are described. In operation of a multi-phase recoding technique a first node in a multi-hop wireless network data communication path between a source node and a destination node provides recoding and transmission of packets of a BNC batch to a second node in the communication path via multiple phases. Multi-phase recoding makes use of the reception status of the recoded packets that have been received by the second node in earlier phases of multi-phase recoding operation with respect to transmission of a particular batch. Multi-phase recoding feedback from the second node to the first node may be provided so that the first node can determine how many recoded packets are to be sent in the next phase of multi-phase recoding operation."
},
"yin23_pktsize_ep":{
	"title":"Systems and Methods for Optimizing Network Transmissions of Batched Network Coded Packets",
	"author":"<b>H. F. H. Yin</b>",
	"fullauthor":"<b>Ho Fai Hoover Yin</b>",
	"address":"EP",
	"filedDate":"April 20, 2023",
	"appNumber":"23169069",
	"url":"https://patents.google.com/patent/EP4266609A1/",
	"abstract":"Batched network coding (BNC) is a low-complexity solution to network transmission in multi-hop networks with packet loss that divides data to be transmitted into multiple packets and pads the data when necessary. However, an inappropriate choice of packet size leads to a significant overhead. Embodiments of the present disclosure provide systems, methods, and apparatuses that overcome the shortcomings of traditional BNC solutions by dynamically deciding a packet size through optimization of the overhead. As a result, embodiments of the present disclosure boost throughput of systems leveraging BNC transmission techniques by providing filespecific and dynamically determined optimizations. The disclosed techniques for performing dynamic optimization of transmissions also reduce computational complexity, enabling use case deployments in which nodes having reduced computational resources and power requirements are utilized while maintaining improved performance of the network (e.g., in terms of throughput, etc.)."
},
"yin23_pktsize_cn":{
	"title":"优化网络传输的系统和方法",
	"title2":"Systems and Methods for Optimizing Network Transmissions",
	"author":"<b>殷浩辉</b>",
	"fullauthor":"<b>殷浩辉</b>",
	"address":"CN",
	"filedDate":"2023.04.19",
	"appNumber":"202310421556.7",
	"url":"https://patents.google.com/patent/CN116916381A/",
	"abstract":"本申请公开了优化网络传输的系统和方法。成批网络编码(BNC)是一种低复杂度的解决方案，用于在具有数据包丢失的多跳网络中进行网络传输，它将要传输的数据划分为多个数据包，并在必要时对数据进行填充。但是，数据包大小选择不当会引起大量开销。本公开的实施例提供了系统、方法和装置，其通过优化开销来动态决定数据包大小以克服传统BNC解决方案的缺点。因此，本公开的实施例通过提供特定于文件和动态确定优化来提高利用BNC传输技术的系统的吞吐量。所公开的用于执行传输动态优化的技术还降低了计算复杂度，使用例部署成为可能，其中利用了具有减少计算资源和功率要求的节点，同时保持网络性能得到改善(例如，在吞吐量等方面)。"
},
"yin22_intrablock_us":{
	"title":"Compatible Packet Separation for Communication Networks",
	"author":"<b>H. F. H. Yin</b>, K. H. Ng, Z. Zhong, R. W. H. Yeung, and S. Yang",
	"fullauthor":"<b>Ho Fai Hoover Yin</b>, Ka Hei Ng, Zhuowei Zhong, Raymond Wai Ho Yeung, Shenghao Yang",
	"address":"US",
	"pubDate":"September 20, 2022",
	"number":"11,452,003",
	"filedDate":"April 1, 2021",
	"appNumber":"17/220,714",
	"url":"https://patents.google.com/patent/US11452003B1/",
	"abstract":"Described herein are systems, methods, and other techniques for compatible packet separation for communication networks. A block comprising a plurality of packets to be transmitted over a network is received. The block includes a set of batches, and the plurality of packets are distributed between the set of batches. A pseudo interleaver depth is calculated for each of the set of batches to produce a set of pseudo interleaver depths. Blockwise adaptive recoding is performed using the set of pseudo interleaver depths to produce a number of recoded packets for each of the set of batches. A transmission sequence is generated using the number of recoded packets for each of the set of batches."
},
"yin20_protocol_mo":{
	"title":"用於設備輔助通信的方法、裝置和計算機可讀介質",
	"title2":"Method, Apparatus, and Computer-Readable Medium for Device-Assisted Communication",
	"author":"<b>殷浩輝</b>, 楊偉豪, 楊升浩",
	"fullauthor":"<b>殷浩輝</b>, 楊偉豪, 楊升浩",
	"address":"MO",
	"pubDate":"2020.10.27",
	"number":"J/4408(871)",
	"filedDate":"2020.09.28",
	"appNumber":"J/004408",
	"url":"https://bo.dsaj.gov.mo/bo/ii/2020/47/economia01_cn.asp",
	"abstract":"本發明涉及用於設備輔助通信的方法、裝置和計算機可讀介質。在具有突發或相關型丟失的網絡中，BATS協議可以被用於高效通信。在中間網絡節點處的系統重新編碼可以用於減少在重新編碼期間的計算成本。可以利用基於塊交織器的BATS協議來處理突發丟失，其中將各批次重新編碼為同樣數量的分組。自適應重新編碼可以被用於提高吞吐量，其中，具有更高秩的批次被重新編碼成更大數量的分組。使用自適應重新編碼，可以利用基於非塊交織器的BATS協議。"
},
"yin20_protocol_cn":{
	"title":"用于设备辅助通信的方法、装置和计算机可读介质",
	"title2":"Method, Apparatus, and Computer-Readable Medium for Device-Assisted Communication",
	"author":"<b>殷浩辉</b>, 杨伟豪, 杨升浩",
	"fullauthor":"<b>殷浩辉</b>, 杨伟豪, 杨升浩",
	"address":"CN",
	"pubDate":"2020.07.28",
	"number":"107040334",
	"filedDate":"2016.09.27",
	"appNumber":"201610857698.8",
	"url":"https://patents.google.com/patent/CN107040334B/",
	"abstract":"本发明涉及用于设备辅助通信的方法、装置和计算机可读介质。在具有突发或相关型丢失的网络中，BATS协议可以被用于高效通信。在中间网络节点处的系统重新编码可以用于减少在重新编码期间的计算成本。可以利用基于块交织器的BATS协议来处理突发丢失，其中将各批次重新编码为同样数量的分组。自适应重新编码可以被用于提高吞吐量，其中，具有更高秩的批次被重新编码成更大数量的分组。使用自适应重新编码，可以利用基于非块交织器的BATS协议。"
},
"yin19_protocol_us":{
	"title":"Loss-Resilient Protocols for Communication Networks",
	"author":"<b>H. F. H. Yin</b>, S. Yang, and W.-H. Yeung",
	"fullauthor":"<b>Ho Fai Hoover Yin</b>, Shenghao Yang, Wai-Ho Raymond Yeung",
	"address":"US",
	"pubDate":"September 24, 2019",
	"number":"10,425,192",
	"filedDate":"September 30, 2015",
	"appNumber":"14/871,257",
	"url":"https://patents.google.com/patent/US10425192B2/",
	"abstract":"BATS protocols may be utilized for high efficiency communication in networks with burst or dependent type losses. Systematic recoding at intermediate network nodes may be utilized to reduce the computational cost during recoding. A block interleaver based BATS protocol may be utilized to handle burst loss, where batches are recoded to a same number of packets. Adaptive recoding may be utilized to improve the throughput, where a batch with a higher rank is recoded to a larger number of packets. Using adaptive recoding, a non-block interleaver based BATS protocol may be utilized."
}
}

