{
"mak23_vae_preprints":{
	"title":"Application of Variational AutoEncoder (VAE) Model and Image Processing Approaches in Game Design",
	"author":"H. W. L. Mak, R. Han, and <b>H. H. F. Yin</b>",
	"fullauthor":"Hugo Wai Leung Mak, Runze Han, <b>Hoover H. F. Yin</b>",
	"journal":"Preprints:202303.0023",
	"date":"Mar. 2023",
	"url":"https://www.preprints.org/manuscript/202303.0023",
	"abstract":"In recent decades, the Variational AutoEncoder (VAE) model has shown good potential and capabilities in image generation and dimensionality reduction. The combination of VAE and various machine learning frameworks has also worked effectively in different daily life applications, however its possibility and effectiveness in modern game design has seldom been explored nor assessed. The use of its feature extractor for data clustering was minimally discussed in literature neither. This paper first attempts to explore different mathematical properties of the VAE model, in particular, the theoretical framework of the encoding and decoding processes, the possible achievable lower bound and loss functions of different applications; then applies the established VAE model into generating new game levels within two well-known game settings; as well as validating the effectiveness of its data clustering mechanism with the aid of the Modified National Institute of Standards and Technology (MNIST) database. Respective statistical metrics and assessments were also utilized for evaluating the performance of the proposed VAE model in aforementioned case studies. Based on the statistical and spatial results, several potential drawbacks and future enhancement of the established model were outlined, with the aim of maximizing the strengths and advantages of VAE for future game design tasks and relevant industrial missions.",
	"field":"math"
},
"yin23_sd_preprints":{
	"title":"Discrete Analogue of Fishburn's Fractional-Order Stochastic Dominance",
	"author":"<b>H. H. F. Yin</b>, X. Wang, H. W. L. Mak, C. S. Au Yong, and I. Y. Y. Chan",
	"fullauthor":"<b>Hoover H. F. Yin</b>, Xishi Wang, Hugo Wai Leung Mak, Chun Sang Au Yong, Ian Y. Y. Chan",
	"journal":"Preprints:202302.0522",
	"date":"Feb. 2023",
	"url":"https://www.preprints.org/manuscript/202302.0522",
	"abstract":"A stochastic dominance (SD) relation can be defined by two different perspectives: One from the view of distributions, and the other one from the view of expected utilities. In early days, Fishburn investigated SD from the view of distributions and we refer this perspective as Fishburn’s SD. One of his many results was the development of fractional-order SD for continuous distributions. However, discrete fractional-order SD may not be generalized directly since some properties of fractional calculus do not have a discrete counterpart. In this paper, we develop a discrete analogue of fractional-order SD from the view of distributions. We generalize the order of SD by Lizama’s fractional delta operator, show the preservation of SD hierarchy, and formulate the utility classes that are congruent with our SD relations. This work brings a message that some results of discrete SD cannot be generalized directly from continuous SD. We characterize the difference between discrete and continuous fractional-order SD, as well as the way to handle them.",
	"field":"math"
},
"yin22_alien_preprints":{
	"title":"Two-State Alien Tiles: A Coding-Theoretical Perspective",
	"author":"<b>H. H. F. Yin</b>, K. H. Ng, S. K. Ma, H. W. H. Wong, and H. W. L. Mak",
	"fullauthor":"<b>Hoover H. F. Yin</b>, Ka Hei Ng, Shi Kin Ma, Harry W. H. Wong, Hugo Wai Leung Mak",
	"journal":"Preprints:202206.0331",
	"date":"Jun. 2022",
	"url":"https://www.preprints.org/manuscript/202206.0331",
	"abstract":"The switching game Lights Out and its variants were studied extensively as recreational mathematics problems. The game board of the ordinary Lights Out is a rectangular grid of lights, where each light is either on or off. By clicking a light, the clicked light and its adjacent rectilinear neighbors are toggled. Given an arbitrary initial configuration of lights, the final mission is to “solve” this game by switching off all the lights. Most studies on Lights Out and its variants focused on the solvability of given games or the number of solvable games, but when the game is viewed in a coding-theoretical perspective, more interesting questions with special meanings in coding theory will naturally pop up, such as finding the minimal number of lit lights among all solvable games except the solved game, or finding the minimal number of lit lights that the player can achieve from a given unsolvable game, etc. However, these problems are usually hard to be solved in general in terms of algorithmic complexity. This study considers a natural extension of the Lights Out game, which enlarges the toggle pattern in a way that all the lights in the same row and those in the same column of the clicked light are toggled. This variant of Lights Out is a two-state version of a switching game called Alien Tiles. In this paper, we investigate the properties of the two-state Alien Tiles, and discuss several coding-theoretical problems about this game. Then, we apply this game as an error correction code and investigate its optimality. We also give a brief overview on algorithmic complexity and coding theory for readers who are not familiar with these topics. The purpose of this paper is to propose ways of playing switching games in a think-outside-the-box manner, which benefit the recreational mathematics community.",
	"field":"math"
},
"yin22_prefix_arxiv":{
	"title":"Multichannel Optimal Tree-Decodable Codes are Not Always Optimal Prefix Codes",
	"author":"<b>H. H. F. Yin</b>, H. W. H. Wong, M. Tahernia, and R. W. F. Lai",
	"fullauthor":"<b>Hoover H. F. Yin</b>, Harry W. H. Wong, Mehrdad Tahernia, Russell W. F. Lai",
	"journal":"arXiv preprint arXiv:2205.05122",
	"date":"May 2022",
	"url":"https://arxiv.org/abs/2205.05122",
	"abstract":"The theory of multichannel prefix codes aims to generalize the classical theory of prefix codes. Although single- and two-channel prefix codes always have decoding trees, the same cannot be said when there are more than two channels. One question is of theoretical interest: Do there exist optimal tree-decodable codes that are not optimal prefix codes? Existing literature, which focused on generalizing single-channel results, covered little about non-tree-decodable prefix codes since they have no single-channel counterparts. In this work, we study the fundamental reason behind the non-tree-decodability of prefix codes. By investigating the simplest non-tree-decodable structure, we obtain a general sufficient condition on the channel alphabets for the existence of optimal tree-decodable codes that are not optimal prefix codes.",
	"field":"it"
},
"egger22_graph_eprint":{
	"title":"On Defeating Graph Analysis of Anonymous Transactions",
	"author":"C. Egger, R. W. F. Lai, V. Ronge, I. K. Y. Woo, and <b>H. H. F. Yin</b>",
	"fullauthor":"Christoph Egger, Russell W. F. Lai, Viktoria Ronge, Ivy K. Y. Woo, <b>Hoover H. F. Yin</b>",
	"journal":"IACR Cryptology ePrint Archive:2022/132",
	"date":"Feb. 2022",
	"url":"https://eprint.iacr.org/2022/132",
	"abstract":"In a ring-signature-based anonymous cryptocurrency, signers of a transaction are hidden among a set of potential signers, called a ring, whose size is much smaller than the number of all users. The ring-membership relations specified by the sets of transactions thus induce bipartite transaction graphs, whose distribution is in turn induced by the ring sampler underlying the cryptocurrency.<p>Since efficient graph analysis could be performed on transaction graphs to potentially deanonymise signers, it is crucial to understand the resistance of (the transaction graphs induced by) a ring sampler against graph analysis. Of particular interest is the class of partitioning ring samplers. Although previous works showed that they provide almost optimal local anonymity, their resistance against global, e.g. graph-based, attacks were unclear.<p>In this work, we analyse transaction graphs induced by partitioning ring samplers. Specifically, we show (partly analytically and partly empirically) that, somewhat surprisingly, by setting the ring size to be at least logarithmic in the number of users, a graph-analysing adversary is no better than the one that performs random guessing in deanonymisation up to constant factor of 2.",
	"field":"crypto"
},
"yin21_adaptive_arxiv":{
	"title":"BAR: Blockwise Adaptive Recoding for Batched Network Coding",
	"author":"<b>H. H. F. Yin</b>, S. Yang, Q. Zhou, L. M. L. Yung, and K. H. Ng",
	"fullauthor":"<b>Hoover H. F. Yin</b>, Shenghao Yang, Qiaoqiao Zhou, Lily M. L. Yung, K. H. Ng",
	"journal":"arXiv preprint arXiv:2105.07617",
	"date":"May 2021",
	"url":"https://arxiv.org/abs/2105.07617",
	"abstract":"Multi-hop networks become popular network topologies in various emerging Internet of things applications. Batched network coding (BNC) is a solution to reliable communications in such networks with packet loss. By grouping packets into small batches and restricting recoding to the packets belonging to the same batch, BNC has a much smaller computational and storage requirements at the intermediate nodes compared with a direct application of random linear network coding. In this paper, we propose a practical recoding scheme called blockwise adaptive recoding (BAR) which learns the latest channel knowledge from short observations so that BAR can adapt to the fluctuation of channel conditions. We focus on investigating practical concerns such as the design of efficient BAR algorithms. We also design and investigate feedback schemes for BAR under imperfect feedback systems. Our numerical evaluations show that BAR has significant throughput gain for small batch size compared with the existing baseline recoding scheme. More importantly, this gain is insensitive to inaccurate channel knowledge. This encouraging result suggests that BAR is suitable to be realized in practice as the exact channel model and its parameters could be unknown and subject to change from time to time.",
	"field":"nc"
},
"yin21_uni_arxiv":{
	"title":"A Unified Adaptive Recoding Framework for Batched Network Coding",
	"author":"<b>H. H. F. Yin</b>, B. Tang, K. H. Ng, S. Yang, X. Wang, and Q. Zhou",
	"fullauthor":"<b>Hoover H. F. Yin</b>, Bin Tang, Ka Hei Ng, Shenghao Yang, Xishi Wang, Qiaoqiao Zhou",
	"journal":"arXiv preprint arXiv:2105.07614",
	"date":"May 2021",
	"url":"https://arxiv.org/abs/2105.07614",
	"abstract":"Batched network coding is a variation of random linear network coding which has low computational and storage costs. In order to adapt to random fluctuations in the number of erasures in individual batches, it is not optimal to recode and transmit the same number of packets for all batches. Different distributed optimization models, which are called adaptive recoding schemes, were formulated for this purpose. The key component of these optimization problems is the expected value of the rank distribution of a batch at the next network node, which is also known as the expected rank. In this paper, we put forth a unified adaptive recoding framework with an arbitrary recoding field size. We show that the expected rank functions are concave when the packet loss pattern is a stationary stochastic process, which covers but not limited to independent packet loss and Gilbert-Elliott packet loss model. Under this concavity assumption, we show that there always exists a solution which not only can minimize the randomness on the number of recoded packets but also can tolerate rank distribution errors due to inaccurate measurements or limited precision of the machine. We provide an algorithm to obtain such an optimal optimal solution, and propose tuning schemes that can turn any feasible solution into a desired optimal solution.",
	"field":"nc"
},
"yin21_intrablock_arxiv":{
	"title":"Intrablock Interleaving for Batched Network Coding with Blockwise Adaptive Recoding",
	"author":"<b>H. H. F. Yin</b>, K. H. Ng, A. Z. Zhong, R. W. Yeung, S. Yang, and I. Y. Y. Chan",
	"fullauthor":"<b>Hoover H. F. Yin</b>, Ka Hei Ng, Allen Z. Zhong, Raymond W. Yeung, Shenghao Yang, Ian Y. Y. Chan",
	"journal":"arXiv preprint arXiv:2105.07609",
	"date":"May 2021",
	"url":"https://arxiv.org/abs/2105.07609",
	"abstract":"Batched network coding (BNC) is a low-complexity solution to network transmission in multi-hop packet networks with packet loss. BNC encodes the source data into batches of packets. As a network coding scheme, the intermediate nodes perform recoding on the received packets belonging to the same batch instead of just forwarding them. A recoding scheme that may generate more recoded packets for batches of a higher rank is also called adaptive recoding. Meanwhile, in order to combat burst packet loss, the transmission of a block of batches can be interleaved. Stream interleaving studied in literature achieves the maximum separation among any two consecutive packets of a batch, but permutes packets across blocks and hence cannot bound the buffer size and the latency. To resolve the issue of stream interleaver, we design an intrablock interleaver for adaptive recoding that can preserve the advantages of using a block interleaver when the number of recoded packets is the same for all batches. We use potential energy in classical mechanics to measure the performance of an interleaver, and propose an algorithm to optimize the interleaver with this performance measure. Our problem formulation and algorithm for intrablock interleaving are also of independent interest.",
	"field":"nc"
},
"dong21_num_arxiv":{
	"title":"Utility Maximization for Multihop Wireless Networks Employing BATS Codes",
	"author":"Y. Dong, S. Jin, Y. Chen, S. Yang, and <b>H. H. F. Yin</b>",
	"fullauthor":"Yanyan Dong, Sheng Jin, Yanzuo Chen, Shenghao Yang, <b>Hoover H. F. Yin</b>",
	"journal":"arXiv preprint arXiv:2105.07605",
	"date":"May 2021",
	"url":"https://arxiv.org/abs/2105.07605",
	"abstract":"BATS (BATched Sparse) codes are a class of efficient random linear network coding variation that has been studied for multihop wireless networks mostly in scenarios of a single communication flow. Towards sophisticated multi-flow network communications, we formulate a network utility maximization (NUM) problem that jointly optimizes the BATS code parameters of all the flows and network scheduling. The NUM problem adopts a batch-wise packet loss model that can be obtained from the network local statistics without any constraints on packet loss patterns. Moreover, the NUM problem allows a different number of recoded packets to be transmitted for different batches in a flow, which is called adaptive recoding. Due to both the probably nonconcave objective and the BATS code-related variables, the algorithms developed for the existing flow optimization problems cannot be applied directly to solve our NUM problem. We introduce a two-step algorithm to solve our NUM problem, where the first step solves the problem with nonadaptive recoding schemes, and the second step optimizes adaptive recoding hop-by-hop from upstream to downstream in each flow. We perform various numerical evaluations and simulations to verify the effectiveness and efficiency of the algorithm.",
	"field":"nc"
},
"yin21_prefix_arxiv":{
	"title":"On Multi-Channel Huffman Codes for Asymmetric-Alphabet Channels",
	"author":"<b>H. H. F. Yin</b>, X. Wang, K. H. Ng, R. W. F. Lai, L. K. L. Ng, and J. P. K. Ma",
	"fullauthor":"<b>Hoover H. F. Yin</b>, Xishi Wang, Ka Hei Ng, Russell W. F. Lai, Lucien K. L. Ng, Jack P. K. Ma",
	"journal":"arXiv preprint arXiv:2105.03606",
	"date":"May 2021",
	"url":"https://arxiv.org/abs/2105.03606",
	"abstract":"Zero-error single-channel source coding has been studied extensively over the past decades. Its natural multi-channel generalization is however not well investigated. While the special case with multiple symmetric-alphabet channels was studied a decade ago, codes in such setting have no advantage over single-channel codes in data compression, making them worthless in most applications. With essentially no development since the last decade, in this paper, we break the stalemate by showing that it is possible to beat single-channel source codes in terms of compression assuming asymmetric-alphabet channels. We present the multi-channel analog of several classical results in single-channel source coding, such as that a multi-channel Huffman code is an optimal tree-decodable code. We also show some evidences that finding an efficient construction of multi-channel Huffman codes may be hard. Nevertheless, we propose a suboptimal code construction whose redundancy is guaranteed to be no larger than that of an optimal single-channel source code.",
	"field":"it"
},
"wang21_inferred_arxiv":{
	"title":"Small-Sample Inferred Adaptive Recoding for Batched Network Coding",
	"author":"J. Wang, Z. Jia, <b>H. H. F. Yin</b>, and S. Yang",
	"fullauthor":"Jie Wang, Zhiyuan Jia, <b>Hoover H. F. Yin</b>, Shenghao Yang",
	"journal":"arXiv preprint arXiv:2105.01370",
	"date":"May 2021",
	"url":"https://arxiv.org/abs/2105.01370",
	"abstract":"Batched network coding is a low-complexity network coding solution to feedbackless multi-hop wireless packet network transmission with packet loss. The data to be transmitted is encoded into batches where each of which consists of a few coded packets. Unlike the traditional forwarding strategy, the intermediate network nodes have to perform recoding, which generates recoded packets by network coding operations restricted within the same batch. Adaptive recoding is a technique to adapt the fluctuation of packet loss by optimizing the number of recoded packets per batch to enhance the throughput. The input rank distribution, which is a piece of information regarding the batches arriving at the node, is required to apply adaptive recoding. However, this distribution is not known in advance in practice as the incoming link's channel condition may change from time to time. On the other hand, to fully utilize the potential of adaptive recoding, we need to have a good estimation of this distribution. In other words, we need to guess this distribution from a few samples so that we can apply adaptive recoding as soon as possible. In this paper, we propose a distributionally robust optimization for adaptive recoding with a small-sample inferred prediction of the input rank distribution. We develop an algorithm to efficiently solve this optimization with the support of theoretical guarantees that our optimization's performance would constitute as a confidence lower bound of the optimal throughput with high probability.",
	"field":"nc"
},
"ronge20_ring_eprint":{
	"title":"Foundations of Ring Sampling",
	"author":"V. Ronge, C. Egger, R. W. F. Lai, D. Schröder, and <b>H. H. F. Yin</b>",
	"fullauthor":"Viktoria Ronge, Christoph Egger, Russell W. F. Lai, Dominique Schröder, <b>Hoover H. F. Yin</b>",
	"journal":"IACR Cryptology ePrint Archive:2020/1550",
	"date":"Dec. 2020",
	"url":"https://eprint.iacr.org/2020/1550",
	"abstract":"A ring signature scheme allows the signer to sign on behalf of an ad hoc set of users, called a ring. The verifier can be convinced that a ring member signs, but cannot point to the exact signer. Ring signatures have become increasingly important today with their deployment in anonymous cryptocurrencies. Conventionally, it is implicitly assumed that all ring members are equally likely to be the signer. This assumption is generally false in reality, leading to various practical and devastating deanonymizing attacks in Monero, one of the largest anonymous cryptocurrencies. These attacks highlight the unsatisfactory situation that how a ring should be chosen is poorly understood.<p>We propose an analytical model of ring samplers towards a deeper understanding of them through systematic studies. Our model helps to describe how anonymous a ring sampler is with respect to a given signer distribution as an information-theoretic measure. We show that this measure is robust, in the sense that it only varies slightly when the signer distribution varies slightly. We then analyze three natural samplers – uniform, mimicking, and partitioning – under our model with respect to a family of signer distributions modeled after empirical Bitcoin data. We hope that our work paves the way towards researching ring samplers from a theoretical point of view.",
	"field":"crypto"
},
"yin19_packing_arxiv":{
	"title":"Decision Procedure for the Existence of Two-Channel Prefix-Free Codes",
	"author":"<b>H. H. F. Yin</b>, K. H. Ng, Y. T. Shing, R. W. F. Lai, and X. Wang",
	"fullauthor":"<b>Hoover H. F. Yin</b>, Ka Hei Ng, Yu Ting Shing, Russell W. F. Lai, Xishi Wang",
	"journal":"arXiv preprint arXiv:1904.12112",
	"date":"Apr. 2019",
	"url":"https://arxiv.org/abs/1904.12112",
	"abstract":"The Kraft inequality gives a necessary and sufficient condition for the existence of a single channel prefix-free code. However, the multichannel Kraft inequality does not imply the existence of a multichannel prefix-free code in general. It is natural to ask whatever there exists an efficient decision procedure for the existence of multichannel prefix-free codes. In this paper, we tackle the two-channel case of the above problem by relating it to a constrained rectangle packing problem. Although a general rectangle packing problem is NP-complete, the extra imposed constraints allow us to propose an algorithm which can solve the problem efficiently.",
	"field":"it"
}
}

